Repository: wafrelka/cms
Catalog: cms/locale/*/LC_MESSAGES/cms.po
Languages: vi

source: Compilation succeeded
vi: Biên dịch thành công

source: Your submission successfully compiled to an excutable.
vi: Bài nộp của bạn đã được biên dịch thành một file có thể chạy.

source: Compilation failed
vi: Biên dịch gặp lỗi

source: Your submission did not compile correctly.
vi: Quá trình biên dịch bài nộp của bạn không thành công.

source: Compilation timed out
vi: Biên dịch quá lâu

source: Your submission exceeded the time limit while compiling. This might be caused by an excessive use of C++ templates, for example.
vi: Bài nộp của bạn cần quá nhiều thời gian để biên dịch. Lỗi này có thể do sử dụng quá nhiều template của C++.

source: Compilation killed with signal %s (could be triggered by violating memory limits)
vi: Quá trình biên dịch bị ngắt bởi tín hiệu %s (có thể do vượt quá giới hạn bộ nhớ)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit for the compilation, and in turn by an excessive use of C++ templates, for example.
vi: Bài nộp của bạn đã bị ngắt bởi tín hiệu nêu trên. Lỗi này có thể do vượt quá giới hạn bộ nhớ cho quá trình biên dịch hoặc sử dụng quá nhiều template của C++.

source: Output is correct
vi: Kết quả đúng

source: Your submission ran and gave the correct answer
vi: Bài nộp của bạn chạy thành công và cho kết quả đúng

source: Output isn't correct
vi: Kết quả sai

source: Your submission ran, but gave the wrong answer
vi: Bài nộp của bạn chạy thành công nhưng cho kết quả sai

source: Evaluation didn't produce file %s
vi: Không tìm thấy file %s

source: Your submission ran, but did not write on the correct output file
vi: Bài nộp của bạn chạy thành công nhưng không ghi kết quả vào file được yêu cầu

source: Execution timed out
vi: Chạy quá lâu

source: Your submission used too much CPU time.
vi: Bài nộp của bạn sử dụng quá nhiều thời gian CPU.

source: Execution timed out (wall clock limit exceeded)
vi: Chạy quá lâu (vượt quá giới hạn thời gian thực tế)

source: Your submission used too much total time. This might be triggered by undefined code, or buffer overflow, for example. Note that in this case the CPU time visible in the submission details might be much smaller than the time limit.
vi: Bài nộp của bạn sử dụng quá nhiều thời gian thực tế. Lỗi này có thể do tràn bộ đệm. Lưu ý rằng trong trường hợp này, thời gian CPU được hiển thị có thể nhỏ hơn rất nhiều so với giới hạn thời gian.

source: Execution killed with signal %d (could be triggered by violating memory limits)
vi: Chương trình bị ngắt bởi tín hiệu %d (có thể do vượt quá giới hạn bộ nhớ)

source: Your submission was killed with the specified signal. Among other things, this might be caused by exceeding the memory limit. Note that if this is the reason, the memory usage visible in the submission details is the usage before the allocation that caused the signal.
vi: Bài nộp của bạn bị ngắt bởi tín hiệu nêu trên. Lỗi này có thể do sử dụng quá giới hạn bộ nhớ. Trong trường hợp đó, lượng bộ nhớ sử dụng được hiển thị là lượng bộ nhớ ngay trước thao tác cấp phát gây ra tín hiệu ngắt.

source: Execution killed because of forbidden syscall %s
vi: Chương trình bị ngắt do syscall %s bị cấm

source: Your submission was killed because it tried to use the forbidden syscall specified in the message.
vi: Bài nộp của bạn bị ngắt do sử dụng syscall bị cấm nêu trên.

source: Execution killed because of forbidden file access
vi: Chương trình bị ngắt do truy cập file bị cấm

source: Your submission was killed because it tried to read or write a forbidden file.
vi: Bài nộp của bạn bị ngắt do đọc hoặc ghi một file bị cấm.

source: Execution failed because the return code was nonzero
vi: Chương trình chạy không thành công vì exitcode khác 0

source: Your submission failed because it exited with a return code different from 0.
vi: Bài nộp của bạn không thành công vì trả về exitcode khác 0.

source: Outcome
vi: Kết quả

source: Details
vi: Chi tiết

source: Execution time
vi: Thời gian chạy

source: Memory used
vi: Bộ nhớ

source: Not correct
vi: Sai

source: Correct
vi: Đúng

source: Partially correct
vi: Đúng một phần

source: Invalid files in submission
vi: Bài nộp chứa file không hợp lệ

source: Execution completed successfully
vi: Chạy thành công

source: No compilation needed
vi: Không cần biên dịch

source: File not submitted
vi: File chưa được nộp

source: %Y-%m-%d
vi: %d-%m-%Y

source: %Y-%m-%d %H:%M:%S
vi: %H:%M:%S %d-%m-%Y

source: loading...
vi: đang tải...

source: %d second
vi: %d giây

source: %d minute
vi: %d phút

source: %d hour
vi: %d giờ

source: %d day
vi: %d ngày

source: %s and %s
vi: %s và %s

source: more than %s
vi: nhiều hơn %s

source: contest-tokens
vi: contest-token

source: task-tokens
vi: task-token

source: tokens
vi: token

source: You don't have %(type_pl)s available for this task.
vi: Bạn không có %(type_pl)s cho bài này.

source: You have an infinite number of %(type_pl)s for this task.
vi: Bạn có vô số %(type_pl)s cho bài này.

source: You start with no %(type_pl)s.
vi: Ban đầu, bạn không có %(type_pl)s nào.

source: You start with one %(type_s)s.
vi: Ban đầu, bạn có %(gen_initial)d %(type_pl)s.

source: Every minute
vi: Mỗi %(gen_interval)d phút

source: you get another %(type_s)s,
vi: bạn có thêm %(gen_number)d %(type_pl)s,

source: up to a maximum of one %(type_s)s.
vi: tối đa là %(gen_max)d %(type_pl)s.

source: you get another %(type_s)s.
vi: bạn có thêm %(gen_number)d %(type_pl)s,

source: You don't get other %(type_pl)s.
vi: Bạn sẽ không có thêm %(type_pl)s.

source: You can use a %(type_s)s every second
vi: Bạn có thể sử dụng 1 %(type_s)s mỗi %(min_interval)g giây

source: and no more than one %(type_s)s in total.
vi: và tổng cộng không vượt quá %(max_number)d %(type_pl)s.

source: You can use a %(type_s)s every second.
vi: Bạn có thể sử dụng 1 %(type_s)s mỗi %(min_interval)g giây.

source: You can use no more than one %(type_s)s in total.
vi: Bạn có thể sử dụng tổng cộng không quá %(max_number)d %(type_pl)s.

source: You have no limitations on how you use them.
vi: Bạn có thể tự do sử dụng chúng.

source: Question received
vi: Câu hỏi đã được tiếp nhận

source: Your question has been received, you will be notified when it is answered.
vi: Câu hỏi của bạn đã được tiếp nhận, bạn sẽ được thông báo khi có câu trả lời.

source: Too many print jobs!
vi: Quá nhiều yêu cầu in!

source: You have reached the maximum limit of at most %d print jobs.
vi: Bạn đã sử dụng hết giới hạn %d yêu cầu in.

source: Invalid format!
vi: Định dạng không hợp lệ!

source: Please select the correct files.
vi: Hãy chọn đúng file.

source: File too big!
vi: File quá lớn!

source: Each file must be at most %d bytes long.
vi: Mỗi file có kích thước tối đa là %d byte.

source: Print job storage failed!
vi: Không thể lưu trữ yêu cầu in!

source: Please try again.
vi: Hãy thử lại.

source: Print job received
vi: Yêu cầu in đã được tiếp nhận

source: Your print job has been received.
vi: Yêu cầu in của bạn đã được tiếp nhận.

source: You have reached the maximum limit of at most %d submissions among all tasks.
vi: Bạn đã đạt đến giới hạn %d lần nộp cho tất cả các bài.

source: You have reached the maximum limit of at most %d submissions on this task.
vi: Bạn đã đạt đến giới hạn %d lần nộp cho bài này.

source: Too many submissions!
vi: Quá nhiều bài nộp!

source: Among all tasks, you can submit again after %d seconds from last submission.
vi: Với tất cả các bài, khoảng cách giữa hai lần nộp tối thiểu là %d giây.

source: For this task, you can submit again after %d seconds from last submission.
vi: Với bài này, khoảng cách giữa hai lần nộp tối thiểu là %d giây.

source: Submissions too frequent!
vi: Thời gian nộp bài quá gần nhau!

source: Invalid submission format!
vi: Định dạng bài nộp không hợp lệ!

source: Invalid archive format!
vi: Định dạng file nén không hợp lệ!

source: The submitted archive could not be opened.
vi: Không mở được file nén đã nộp.

source: Cannot recognize submission's language.
vi: Không nhận diện được ngôn ngữ sử dụng trong bài nộp.

source: All sources must be in the same language.
vi: Tất cả mã nguồn cần sử dụng chung một ngôn ngữ.

source: Language %s not allowed in this contest.
vi: Ngôn ngữ %s không được sử dụng trong kì thi này.

source: Invalid submission!
vi: Bài nộp không hợp lệ!

source: Submission too big!
vi: Kích thước bài nộp quá lớn!

source: Each source file must be at most %d bytes long.
vi: Mỗi file mã nguồn có độ dài tối đa là %d byte.

source: Submission storage failed!
vi: Không thể lưu trữ lại bài nộp!

source: Submission received
vi: Nộp bài thành công

source: Your submission has been received and is currently being evaluated.
vi: Bài nộp của bạn đã được tiếp nhận và đang được chấm.

source: Compiling...
vi: Đang biên dịch...

source: details
vi: chi tiết

source: Evaluating...
vi: Đang chấm...

source: Scoring...
vi: Đang tính điểm...

source: Evaluated
vi: Đã chấm xong

source: Token request discarded
vi: Yêu cầu sử dụng token không được chấp nhận

source: Your request has been discarded because you have no tokens available.
vi: Yêu cầu sử dụng token không được chấp nhận do bạn không còn token nào.

source: Your request has been discarded because you already used a token on that submission.
vi: Yêu cầu sử dụng token không được chấp nhận do bạn đã sử dụng token cho bài nộp đó.

source: Token request received
vi: Yêu cầu sử dụng token đã được tiếp nhận

source: Your request has been received and applied to the submission.
vi: Yêu cầu của bạn đã được tiếp nhận và áp dụng vào bài nộp.

source: You have reached the maximum limit of at most %d tests among all tasks.
vi: Bạn đã đạt đến giới hạn %d lần chạy thử cho tất cả các bài.

source: You have reached the maximum limit of at most %d tests on this task.
vi: Bạn đã đạt đến giới hạn %d lần chạy thử cho bài này.

source: Too many tests!
vi: Quá nhiều lần chạy thử!

source: Among all tasks, you can test again after %d seconds from last test.
vi: Với tất cả các bài, khoảng cách giữa hai lần chạy thử tối thiểu là %d giây.

source: For this task, you can test again after %d seconds from last test.
vi: Với bài này, khoảng cách giữa hai lần chạy thử tối thiểu là %d giây.

source: Tests too frequent!
vi: Thời gian chạy thử quá gần nhau!

source: Invalid test format!
vi: Định dạng yêu cầu chạy thử không hợp lệ!

source: Cannot recognize test's language.
vi: Không nhận diện được ngôn ngữ sử dụng trong yêu cầu chạy thử.

source: Invalid test!
vi: Yêu cầu chạy thử không hợp lệ!

source: Test too big!
vi: Kích thước yêu cầu chạy thử quá lớn!

source: Input too big!
vi: Dữ liệu vào quá lớn!

source: The input file must be at most %d bytes long.
vi: File dữ liệu vào có kích thước tối đa là %d byte.

source: Test storage failed!
vi: Không thể lưu trữ yêu cầu chạy thử!

source: Test received
vi: Yêu cầu chạy thử đã được tiếp nhận

source: Your test has been received and is currently being executed.
vi: Yêu cầu chạy thử của bạn đã được tiếp nhận và đang được chạy.

source: Executing...
vi: Đang chạy...

source: Executed
vi: Đã chạy xong

source: %(seconds)0.3f s
vi: %(seconds)0.3f giây

source: Automatic (%s)
vi: Tự động (%s)

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
vi: Đăng nhập dưới tên <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Logout
vi: Đăng xuất

source: Failed to log in.
vi: Đăng nhập không thành công.

source: Welcome
vi: Chào mừng

source: Please log in
vi: Hãy đăng nhập

source: Username
vi: Tài khoản

source: Password
vi: Mật khẩu

source: Login
vi: Đăng nhập

source: Reset
vi: Hủy

source: New message
vi: Tin mới

source: New announcement
vi: Thông báo mới

source: New answer
vi: Câu trả lời mới

source: %d unread
vi: chưa đọc %d

source: Until contest starts:
vi: Kì thi bắt đầu sau:

source: Until contest ends:
vi: Kì thi kết thúc sau:

source: Time left:
vi: Thời gian còn lại:

source: Server time:
vi: Thời gian của máy chủ:

source: Overview
vi: Tổng quan

source: Communication
vi: Thông báo

source: Statement
vi: Đề bài

source: Submissions
vi: Bài nộp

source: Documentation
vi: Tài liệu

source: Testing
vi: Kiểm thử

source: Printing
vi: In

source: is released under the
vi: được phát hành theo

source: GNU Affero General Public License
vi: Giấy phép Công cộng GNU Affero

source: Announcements
vi: Thông báo

source: (no subject)
vi: (không có tiêu đề)

source: Questions
vi: Câu hỏi

source: Subject
vi: Tiêu đề

source: Text
vi: Nội dung

source: Ask question
vi: Hỏi

source: no answer yet
vi: chưa có câu trả lời

source: Messages
vi: Tin nhắn

source: Programming languages and libraries
vi: Ngôn ngữ lập trình và thư viện

source: Submission details for compilation
vi: Chi tiết biên dịch bài nộp

source: Message
vi: Tin nhắn

source: Explanation
vi: Giải thích

source: Submission details for evaluation
vi: Chi tiết chấm bài nộp

source: Error %d
vi: Lỗi %d

source: An error occured while the server was handling your request.
vi: Có lỗi xảy ra khi xử lí yêu cầu của bạn.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
vi: Việc làm sai lệch quá trình hoạt động của Contest Management System (ví dụ thăm dò máy chủ với URL tuỳ chỉnh) có thể bị coi là gian lận và có thể dẫn tới huỷ bỏ quyền dự thi.

source: If you encountered this error during normal usage, please notify the contest administrators.
vi: Nếu bạn gặp lỗi này khi đang sử dụng bình thường, hãy thông báo với ban tổ chức kì thi.

source: General information
vi: Thông tin chung

source: The contest hasn't started yet.
vi: Kì thi chưa bắt đầu.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
vi: Kì thi sẽ bắt đầu tại thời điểm %(start_time)s và kết thúc tại thời điểm %(stop_time)s.

source: The contest is currently running.
vi: Kì thi đang diễn ra.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
vi: Kì thi đã bắt đầu tại thời điểm %(start_time)s và sẽ kết thúc tại thời điểm %(stop_time)s.

source: The contest has already ended.
vi: Kì thi đã kết thúc.

source: The contest started at %(start_time)s and ended at %(stop_time)s.
vi: Kì thi đã bắt đầu tại thời điểm %(start_time)s và kết thúc tại thời điểm %(stop_time)s.

source: You have an infinite number of tokens.
vi: Bạn có vô số token.

source: You can see the detailed result of a submission by using a token on it.
vi: Bạn có thể xem chi tiết chấm của một bài nộp bằng cách sử dụng một token.

source: Your score for each task will be the maximum among the tokened submissions and the last one.
vi: Điểm cho mỗi bài của bạn sẽ là điểm lớn nhất trong số các bài nộp đã sử dụng token và bài nộp cuối cùng.

source: You have a distinct set of tokens for each task.
vi: Với mỗi bài, bạn có một bộ token khác nhau.

source: You can find the rules for the %(type_pl)s on each task's description page.
vi: Xem trang tổng quan của mỗi bài để biết về quy định sử dụng %(type_pl)s.

source: You have a set of tokens shared among all tasks.
vi: Bạn có một bộ token dùng chung cho tất cả các bài.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
vi: Bạn có hai loại token: một bộ <em>contest-token</em> dùng chung cho tất cả các bài và mỗi bài có có một bộ <em>task-token</em>.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
vi: Bạn có thể xem chi tiết chấm của một bài nộp bằng cách sử dụng một contest-token và một task-token.

source: You can submit at most %(submissions)s solutions during this contest.
vi: Bạn có thể nộp tối đa %(submissions)s bài nộp trong kì thi này.

source: You can submit at most %(user_tests)s user tests during this contest.
vi: Bạn có thể yêu cầu tối đa %(user_tests)s lần chạy thử trong kì thi này.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
vi: Mỗi thí sinh được dự thi (nộp bài) trong khoảng thời gian %(per_user_time)s liên tiếp.

source: As soon as the contest starts you can choose to start your time frame.
vi: Bạn có thể bắt đầu tính giờ cho mình ngay sau khi kì thi bắt đầu.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
vi: Khi đã bắt đầu, bạn có thể nộp bài cho tới khi hết khoảng thời gian quy định, hoặc khi kì thi kết thúc, tuy theo sự kiện nào xảy ra trước.

source: By clicking on the button below you can start your time frame.
vi: Nhấn vào nút dưới đây để bắt đầu tính giờ làm bài.

source: You started your time frame at %(start_time)s.
vi: Bạn đã bắt đầu làm bài từ %(start_time)s.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
vi: Bạn có thể nộp bài cho tới khi hết khoảng thời gian quy định, hoặc khi kì thi kết thúc, tuỳ theo sự kiện nào xảy ra trước.

source: You started your time frame at %(start_time)s and you already finished it.
vi: Bạn đã bắt đầu làm bài từ thời điểm %(start_time)s và đã hết thời gian quy định.

source: There's nothing you can do now.
vi: Hiện giờ bạn không thể làm gì được nữa.

source: You never started your time frame. Now it's too late.
vi: Bạn chưa bắt đầu tính giờ làm bài, nhưng giờ đã quá muộn.

source: Start!
vi: Bắt đầu!

source: Task overview
vi: Tổng quan bài

source: Task
vi: Bài

source: Name
vi: Tên

source: Time limit
vi: Giới hạn thời gian

source: Memory limit
vi: Giới hạn bộ nhớ

source: Type
vi: Loại

source: Files
vi: File

source: Tokens
vi: Token

source: %(seconds)g second
vi: %(seconds)g giây

source: %(seconds)g seconds
vi: %(seconds)g giây

source: Yes
vi: Có

source: No
vi: Không

source: Print
vi: In

source: You can print %(remaining_jobs)d more text or PDF files of up to %(max_pages)d pages each.
vi: Bạn có thể in thêm tối đa %(remaining_jobs)d file văn bản hoặc PDF, mỗi file dài không quá %(max_pages)d trang.

source: You can print %(remaining_jobs)d more text files of up to %(max_pages)d pages each.
vi: Bạn có thể in thêm tối đa %(remaining_jobs)d file văn bản, mỗi file dài không quá %(max_pages)d trang.

source: File (text or PDF)
vi: File (văn bản hoặc PDF)

source: File (text)
vi: File (văn bản)

source: Submit
vi: Nộp

source: You cannot print anything any more as you have used up your printing quota.
vi: Bạn đã sử dụng hết số lần in cho phép.

source: Previous print jobs
vi: Các yêu cầu in trước

source: Date and time
vi: Thời điểm

source: Time
vi: Thời gian

source: File name
vi: Tên file

source: Status
vi: Tình trạng

source: no print jobs yet
vi: chưa có yêu cầu in nào

source: Preparing...
vi: Đang chuẩn bị...

source: Compilation output
vi: Thông báo từ trình biên dịch

source: Compilation outcome:
vi: Kết quả biên dịch

source: Compilation time:
vi: Thời gian biên dịch

source: Memory used:
vi: Bộ nhớ:

source: Standard output
vi: Luồng ra chuẩn

source: Standard error
vi: Luồng báo lỗi

source: None
vi: Không có gì

source: Download
vi: Tải xuống

source: Played
vi: Đã sử dụng

source: Play!
vi: Sử dụng!

source: Wait...
vi: Chờ...

source: No tokens
vi: Không có token

source: %(name)s (%(short_name)s) <small>description</small>
vi: <small>Đề bài</small> %(name)s (%(short_name)s)

source: no statement available
vi: không có đề bài

source: Download task statement
vi: Tải xuống đề bài

source: The statement for this task is available in multiple versions, in different languages.
vi: Bài này có nhiều phiên bản đề bài, dưới nhiều ngôn ngữ khác nhau.

source: You can see (and download) all of them using the list on the right.
vi: Bạn có thể xem (và tải xuống) sử dụng danh sách bên phải.

source: Some suggested translations follow.
vi: Một số bản dịch gợi ý.

source: Statement in <b>%s</b>
vi: Đề bài theo ngôn ngữ <b>%s</b>

source: Statement in %s
vi: Đề bài theo ngôn ngữ %s

source: Some details
vi: Chi tiết

source: Compilation commands
vi: Lệnh biên dịch

source: You can find the rules for the %(type_pl)s on the <a href="%(url_root)s/">contest overview page</a>.
vi: Bạn có thể đọc quy định về %(type_pl)s tại <a href="%(url_root)s/">trang tổng quan kì thi</a>.

source: Remeber that to see the detailed result of a submission you need to use both a contest-token and a task-token.
vi: Chú ý rằng để xem chi tiết chấm của một bài nộp bạn cần sử dụng một contest-token và một task-token.

source: Attachments
vi: Đính kèm

source: %(name)s (%(short_name)s) <small>submissions</small>
vi: <small>Bài nộp</small> %(name)s (%(short_name)s)

source: Submit a solution
vi: Nộp bài

source: You can submit %(submissions_left)s more solution(s).
vi: Bạn còn %(submissions_left)s lần nộp bài.

source: Previous submissions
vi: Các bài nộp

source: Right now, you have infinite tokens available on this task.
vi: Tại thời điểm này, với bài này, bạn có vô số token.

source: Right now, you have one token available on this task.
vi: Tại thời điểm này, với bài này, bạn có 1 token.

source: Right now, you have %(tokens)s tokens available on this task.
vi: Tại thời điểm này, với bài này, bạn có %(tokens)s token.

source: But you have to wait until %(expiration_time)s to use them.
vi: Nhưng bạn phải chờ cho tới %(expiration_time)s mới có thể sử dụng.

source: You will receive a new token at %(gen_time)s.
vi: Bạn sẽ có thêm 1 token tại thời điểm %(gen_time)s.

source: In the current situation, no more tokens will be generated.
vi: Hiện tại, sẽ không có thêm token nào được tạo ra.

source: Right now, you do not have tokens available for this task.
vi: Tại thời điểm này, với bài này, bạn không có token nào.

source: But you will have to wait until %(expiration_time)s to use it.
vi: Nhưng bạn phải chờ tới thời điểm %(expiration_time)s mới có thể sử dụng.

source: Public score
vi: Điểm công khai

source: Total score
vi: Điểm tổng

source: Score
vi: Điểm

source: no submissions yet
vi: chưa có bài nộp nào

source: Submission details
vi: Chi tiết bài nộp

source: Close
vi: Đóng

source: Submit a test
vi: Nộp một yêu cầu chạy thử

source: You can submit %(user_tests_left)s more test(s).
vi: Bạn còn %(user_tests_left)s lần chạy thử.

source: input
vi: dữ liệu vào

source: Previous tests
vi: Các yêu cầu chạy thử trước

source: Input
vi: Dữ liệu vào

source: Output
vi: Kết quả ra

source: no tests yet
vi: chưa có yêu cầu chạy thử nào

source: Test details
vi: Chi tiết chạy thử

source: Evaluation outcome
vi: Kết quả chấm
